Ran Plan for dir: `_infra` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.b has been deleted
- resource "aws_s3_bucket" "b" {
      - acl                         = "public-read" -> null
      - arn                         = "arn:aws:s3:::bucket-terraform" -> null
      - bucket                      = "bucket-terraform" -> null
      - bucket_domain_name          = "bucket-terraform.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "bucket-terraform.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "bucket-terraform" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags_all                    = {} -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.b will be created
+ resource "aws_s3_bucket" "b" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "test"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Empty provider configuration blocks are not required

  on modules/app/app.tf line 10:
  10: provider "docker" {}

Remove the docker provider block from module.app1.

(and one more similar warning elsewhere)
2021/11/25 18:03:27 [DEBUG] DELETE http://localhost:8000/api/v1/project/12345/terraform/state/unlock/terraform.lock

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d _infra`
* :put_litter_in_its_place: To **delete** this plan click [here](https://6990-2a02-c7e-2c31-4b00-845-9d36-e82f-3c76.ngrok.io/lock?id=nassergonzalez%252Finfra-test%252F_infra%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d _infra -- -var bucket_name=test`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
